dummy/app/controllers/shop_controller.rb

SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
---
  def order
    notice = I18n.t(:no_order_found)
    if( session[:order])
      @order = Order.find( session[:order] )