app/controllers/stripe_clerk/charges_controller.rb

SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 4]]
UPDATE "orders" SET "address" = ?, "paid_on" = ?, "payment_info" = ?, "payment_type" = ?, "updated_at" = ? WHERE "orders"."id" = 4
---
  def create
    order = Order.find( session[:order] )
    amount = order.total_price

    customer = Stripe::Customer.create(
      :email => 'example@stripe.com',
      :card  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => (amount*100).to_i,
      :description => 'Rails Stripe customer',
      :currency    => 'eur'
    )

    order.pay_now
    order.payment_info = charge.id
    order.payment_type = "stripe"
    order.save